# Mundo 18

### Limpeza e tratamento de dados

In [1]:
import pandas as pd
import yfinance as yf

/home/vinicius/.local/lib/python3.8/site-packages/pandas/core/computation/expressions.py:20: UserWarning: Pandas requires version '2.7.3' or newer of 'numexpr' (version '2.7.1' currently installed).
  from pandas.core.computation.check import NUMEXPR_INSTALLED

In [2]:
dados_ambev = yf.download("ABEV3.SA")
dados_ambev

[*********************100%***********************]  1 of 1 completed

                 Open       High        Low      Close  Adj Close    Volume
Date
2000-01-05   0.520882   0.520882   0.520882   0.520882   0.305528       985
2000-01-06   0.494478   0.494478   0.494478   0.494478   0.290040       227
2000-01-07   0.494478   0.494478   0.494478   0.494478   0.290040       151
2000-01-10   0.494478   0.494478   0.494478   0.494478   0.290040      1516
2000-01-11   0.494478   0.494478   0.494478   0.494478   0.290040      3791
...               ...        ...        ...        ...        ...       ...
2023-01-10  14.260000  14.600000  14.250000  14.540000  14.540000  35535000
2023-01-11  14.510000  14.790000  13.950000  14.290000  14.290000  74419600
2023-01-12  13.800000  14.170000  13.660000  14.100000  14.100000  69959500
2023-01-13  14.000000  14.050000  13.770000  13.880000  13.880000  44291300
2023-01-16  13.720000  13.740000  13.180000  13.200000  13.200000  58837000

[5787 rows x 6 columns]

In [3]:
#mudar o tipo de dado de uma coluna inteira

dados_ambev['High'] = dados_ambev['High'].astype(int)
dados_ambev['Close'] = dados_ambev['Close'].astype(str)


dados_ambev

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2000-01-05,0.520882,0,0.520882,0.5208820104598999,0.305528,985
2000-01-06,0.494478,0,0.494478,0.4944779872894287,0.290040,227
2000-01-07,0.494478,0,0.494478,0.4944779872894287,0.290040,151
2000-01-10,0.494478,0,0.494478,0.4944779872894287,0.290040,1516
2000-01-11,0.494478,0,0.494478,0.4944779872894287,0.290040,3791
...,...,...,...,...,...,...
2023-01-10,14.260000,14,14.250000,14.539999961853027,14.540000,35535000
2023-01-11,14.510000,14,13.950000,14.289999961853027,14.290000,74419600
2023-01-12,13.800000,14,13.660000,14.100000381469727,14.100000,69959500
2023-01-13,14.000000,14,13.770000,13.880000114440918,13.880000,44291300
2023-01-16,13.720000,13,13.180000,13.199999809265137,13.200000,58837000

In [4]:
df_data_teste = pd.DataFrame({'datas': ["3/12/2020", "4/12/2020"],
                             'cotacoes': [20, 21]})

print(type(df_data_teste['datas'].iloc[0]))
df_data_teste

<class 'str'>

       datas  cotacoes
0  3/12/2020        20
1  4/12/2020        21

In [5]:
df_data_teste['datas'] = pd.to_datetime(df_data_teste['datas'], format = "%d/%m/%Y")

print(type(df_data_teste['datas'].iloc[0]))
print(df_data_teste['datas'].iloc[0].year)
df_data_teste

<class 'pandas._libs.tslibs.timestamps.Timestamp'>
2020

       datas  cotacoes
0 2020-12-03        20
1 2020-12-04        21

In [7]:
#como substituir dados em uma coluna? .replace

dados_euca3 = pd.read_excel('dados_euca3.xlsx')

dados_euca3

         Data  EUCA3
0  2022-09-22     nd
1  2022-09-21   12.5
2  2022-09-20  12.78
3  2022-09-19  12.78
4  2022-09-16     nd
..        ...    ...
80 2022-05-31  15.64
81 2022-05-30  15.68
82 2022-05-27  15.77
83 2022-05-26  15.43
84 2022-05-25  15.28

[85 rows x 2 columns]

In [8]:
dados_euca3['EUCA3'] = dados_euca3['EUCA3'].replace("nd", pd.NA) 

print(dados_euca3)

dados_euca3['EUCA3'] = dados_euca3['EUCA3'].replace(pd.NA, 0) 

dados_euca3

         Data  EUCA3
0  2022-09-22   <NA>
1  2022-09-21   12.5
2  2022-09-20  12.78
3  2022-09-19  12.78
4  2022-09-16   <NA>
..        ...    ...
80 2022-05-31  15.64
81 2022-05-30  15.68
82 2022-05-27  15.77
83 2022-05-26  15.43
84 2022-05-25  15.28

[85 rows x 2 columns]

         Data  EUCA3
0  2022-09-22   0.00
1  2022-09-21  12.50
2  2022-09-20  12.78
3  2022-09-19  12.78
4  2022-09-16   0.00
..        ...    ...
80 2022-05-31  15.64
81 2022-05-30  15.68
82 2022-05-27  15.77
83 2022-05-26  15.43
84 2022-05-25  15.28

[85 rows x 2 columns]

In [10]:
df_strings = pd.Series(["Ordem: Compra", "Ordem: Hold"])
                        
print(df_strings.replace("Compra", "Venda"))

df_strings = df_strings.str.replace(": Compra", "- Venda")

df_strings

0    Ordem: Compra
1      Ordem: Hold
dtype: object

0    Ordem- Venda
1     Ordem: Hold
dtype: object

# Exercícios

* Exercício 68: Puxe cotações da MGLU3.SA do yahoo finance e converta a coluna de fechamento ajustado para int.
* Exercício 69: Crie uma série de dados com os seguinte valores: 20, 30, NA, 25, 22, NA, 17. A partir dessa série:

       - Preencha os dados de NA com o valor "0"
       - Calcule os retornos diários.
       - Retire os retornos "NA"
       - Subistua os valores -1 e infinito por zero.

In [12]:
#gabarito 68

dados_mglu = yf.download("MGLU3.SA")['Adj Close']

dados_mglu = dados_mglu.astype(int)

dados_mglu

Date
2017-10-02    2
2017-10-03    2
2017-10-04    2
2017-10-05    2
2017-10-06    2
             ..
2022-09-23    4
2022-09-26    4
2022-09-27    4
2022-09-28    4
2022-09-29    4
Name: Adj Close, Length: 1242, dtype: int32

In [13]:
#gabarito 69
import numpy as np

serie_dados = pd.Series([20, 30, pd.NA, 25, 22, pd.NA, 17])

serie_dados = serie_dados.fillna(0)

retornos = []

for i, dado in enumerate(serie_dados):
    
    if i == 0:
        
        retornos.append(pd.NA)
    
    else:
        
        retorno = serie_dados[i]/serie_dados[i - 1] - 1
        
        retornos.append(retorno)
        
        
serie_retornos = pd.Series(retornos)

serie_retornos = serie_retornos.dropna()

serie_retornos = serie_retornos.replace([-1, np.inf], 0) #sempre pensem em listas quando precisar de mais de 1 elemento

serie_retornos

C:\Users\lsiqu\AppData\Local\Temp\ipykernel_7756\1335273469.py:18: RuntimeWarning: divide by zero encountered in longlong_scalars
  retorno = serie_dados[i]/serie_dados[i - 1] - 1

1    0.50
2    0.00
3    0.00
4   -0.12
5    0.00
6    0.00
dtype: float64

# Mundo 19

Na próxima aula nós vamos aprender sobre algo muito importante: como alterar todos os dados de uma coluna de acordo com a nossa preferência? Por exemplo, como transformar uma coluna de rentabilidade diária média de uma ação em rentabilidade ao ano?